# Rebar Bend Data Crank Ratio 0 Property

Source: https://www.revitapidocs.com/2026/c431bce5-229a-397b-9df3-74c04eca733e.htm

---

| Rebar Bend Data Crank Ratio 0 Property |
| --- |

Identifies the crank ratio at the start. The 1:crankRatio that defines the crank slope.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankRatio0 { get; }
```

```
Public ReadOnly Property CrankRatio0 As Double
	Get
```

```
public:
property double CrankRatio0 {
	double get ();
}
```

```
member CrankRatio0 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace